---
type: AssetPropertyEnum
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 2
tags: [revit-api, class]
---

# AssetPropertyEnum

`Autodesk.Revit.DB.Visual.AssetPropertyEnum` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidValue | 2018.1 | `public bool IsValidValue ( int value )` |
| Property | Value | — | `public int Value { get ; set ; }` |